read_verilog serial_paralelo.v 

hierarchy -check -top serial_paralelo

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ../lib/cmos_cells.lib

abc -liberty ../lib/cmos_cells.lib

clean

write_verilog sintetizado_serial_paralelo.v