read_verilog demux_8_32.v 

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ./cmos_cells.lib

abc -liberty ./cmos_cells.lib

clean

write_verilog sintetizado8a32_cmos.v