read_verilog demux_32_8.v 

hierarchy -check -top demux_32_8

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ../lib/cmos_cells.lib

abc -liberty ../lib/cmos_cells.lib

clean

write_verilog sintetizado32a8_cmos.v