read_verilog recirculador.v 

hierarchy -check -top recirculador

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ./cmos_cells.lib

abc -liberty ./cmos_cells.lib

clean

write_verilog sintetizado_recirc_cmos.v