read_verilog demux_striping.v

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ./cmos_cells.lib

abc -liberty ./cmos_cells.lib

clean

write_verilog demux_striping_sintetizado.v