read_verilog paralelo_serial.v 

hierarchy -check -top paralelo_serial

proc; opt; memory; opt; fsm; opt;

techmap; opt;

dfflibmap -liberty ../lib/cmos_cells.lib

abc -liberty ../lib/cmos_cells.lib

clean

write_verilog sintetizado_paralelo_serial_cmos.v